--------------------------------------------------------------------------------
-- Ящик с предохранителями (ЯП-57)
--------------------------------------------------------------------------------
Metrostroi.DefineSystem("YAP_57")

function TRAIN_SYSTEM:Initialize()
	-- Предохранитель главной электрической цепи
	self.Train:LoadSystem("PNB_1250_1","Fuse","PNB_1250_630_0")
	self.Train:LoadSystem("PNB_1250_2","Fuse","PNB_1250_630_0")
	
	-- Предохранитель вспомагательных электрических цепей
	self.Train:LoadSystem("PP_28","Fuse","PP-28")
end